Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz1064dak169.h
#define _DEVADC2_ADCFG_POSITION                  0x00000000
#define _DEVADC2_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC2_ADCFG_LENGTH                    0x00000020

#define _DEVADC2_w_POSITION                      0x00000000
#define _DEVADC2_w_MASK                          0xFFFFFFFF
#define _DEVADC2_w_LENGTH                        0x00000020

#define _DEVADC3_ADCFG_POSITION                  0x00000000
#define _DEVADC3_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC3_ADCFG_LENGTH                    0x00000020

#define _DEVADC3_w_POSITION                      0x00000000
#define _DEVADC3_w_MASK                          0xFFFFFFFF
#define _DEVADC3_w_LENGTH                        0x00000020

#define _DEVADC4_ADCFG_POSITION                  0x00000000
#define _DEVADC4_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC4_ADCFG_LENGTH                    0x00000020

#define _DEVADC4_w_POSITION                      0x00000000
#define _DEVADC4_w_MASK                          0xFFFFFFFF
#define _DEVADC4_w_LENGTH                        0x00000020

#define _DEVADC7_ADCFG_POSITION                  0x00000000
#define _DEVADC7_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC7_ADCFG_LENGTH                    0x00000020

#define _DEVADC7_w_POSITION                      0x00000000
#define _DEVADC7_w_MASK                          0xFFFFFFFF
#define _DEVADC7_w_LENGTH                        0x00000020

#define _DEVSN0_SN_POSITION                      0x00000000
#define _DEVSN0_SN_MASK                          0xFFFFFFFF
#define _DEVSN0_SN_LENGTH                        0x00000020

#define _DEVSN0_w_POSITION                       0x00000000
#define _DEVSN0_w_MASK                           0xFFFFFFFF
#define _DEVSN0_w_LENGTH                         0x00000020

#define _DEVSN1_SN_POSITION                      0x00000000
#define _DEVSN1_SN_MASK                          0xFFFFFFFF
#define _DEVSN1_SN_LENGTH                        0x00000020

#define _DEVSN1_w_POSITION                       0x00000000
#define _DEVSN1_w_MASK                           0xFFFFFFFF
#define _DEVSN1_w_LENGTH                         0x00000020

#define _DEVSN2_SN_POSITION                      0x00000000
#define _DEVSN2_SN_MASK                          0xFFFFFFFF
#define _DEVSN2_SN_LENGTH                        0x00000020

#define _DEVSN2_w_POSITION                       0x00000000
#define _DEVSN2_w_MASK                           0xFFFFFFFF
#define _DEVSN2_w_LENGTH                         0x00000020

#define _DEVSN3_SN_POSITION                      0x00000000
#define _DEVSN3_SN_MASK                          0xFFFFFFFF
#define _DEVSN3_SN_LENGTH                        0x00000020

#define _DEVSN3_w_POSITION                       0x00000000
#define _DEVSN3_w_MASK                           0xFFFFFFFF
#define _DEVSN3_w_LENGTH                         0x00000020

#define _ADEVCFG4_SWDTPS_POSITION                0x00000018
#define _ADEVCFG4_SWDTPS_MASK                    0x1F000000
#define _ADEVCFG4_SWDTPS_LENGTH                  0x00000005

#define _ADEVCFG4_w_POSITION                     0x00000000
#define _ADEVCFG4_w_MASK                         0xFFFFFFFF
#define _ADEVCFG4_w_LENGTH                       0x00000020

#define _ADEVCFG3_USERID_POSITION                0x00000000
#define _ADEVCFG3_USERID_MASK                    0x0000FFFF
#define _ADEVCFG3_USERID_LENGTH                  0x00000010

#define _ADEVCFG3_FMIIEN_POSITION                0x00000018
#define _ADEVCFG3_FMIIEN_MASK                    0x01000000
#define _ADEVCFG3_FMIIEN_LENGTH                  0x00000001

#define _ADEVCFG3_FETHIO_POSITION                0x00000019
#define _ADEVCFG3_FETHIO_MASK                    0x02000000
#define _ADEVCFG3_FETHIO_LENGTH                  0x00000001

#define _ADEVCFG3_PGL1WAY_POSITION               0x0000001B
#define _ADEVCFG3_PGL1WAY_MASK                   0x08000000
#define _ADEVCFG3_PGL1WAY_LENGTH                 0x00000001

#define _ADEVCFG3_PMDL1WAY_POSITION              0x0000001C
#define _ADEVCFG3_PMDL1WAY_MASK                  0x10000000
#define _ADEVCFG3_PMDL1WAY_LENGTH                0x00000001

#define _ADEVCFG3_IOL1WAY_POSITION               0x0000001D
#define _ADEVCFG3_IOL1WAY_MASK                   0x20000000
#define _ADEVCFG3_IOL1WAY_LENGTH                 0x00000001

#define _ADEVCFG3_w_POSITION                     0x00000000
#define _ADEVCFG3_w_MASK                         0xFFFFFFFF
#define _ADEVCFG3_w_LENGTH                       0x00000020

#define _ADEVCFG2_FPLLIDIV_POSITION              0x00000000
#define _ADEVCFG2_FPLLIDIV_MASK                  0x00000007
#define _ADEVCFG2_FPLLIDIV_LENGTH                0x00000003

#define _ADEVCFG2_FPLLRNG_POSITION               0x00000004
#define _ADEVCFG2_FPLLRNG_MASK                   0x00000070
#define _ADEVCFG2_FPLLRNG_LENGTH                 0x00000003

#define _ADEVCFG2_FPLLICLK_POSITION              0x00000007
#define _ADEVCFG2_FPLLICLK_MASK                  0x00000080
#define _ADEVCFG2_FPLLICLK_LENGTH                0x00000001

#define _ADEVCFG2_FPLLMULT_POSITION              0x00000008
#define _ADEVCFG2_FPLLMULT_MASK                  0x00007F00
#define _ADEVCFG2_FPLLMULT_LENGTH                0x00000007

#define _ADEVCFG2_FPLLODIV_POSITION              0x00000010
#define _ADEVCFG2_FPLLODIV_MASK                  0x00070000
#define _ADEVCFG2_FPLLODIV_LENGTH                0x00000003

#define _ADEVCFG2_VBATBOREN_POSITION             0x00000013
#define _ADEVCFG2_VBATBOREN_MASK                 0x00080000
#define _ADEVCFG2_VBATBOREN_LENGTH               0x00000001

#define _ADEVCFG2_DSBOREN_POSITION               0x00000014
#define _ADEVCFG2_DSBOREN_MASK                   0x00100000
#define _ADEVCFG2_DSBOREN_LENGTH                 0x00000001

#define _ADEVCFG2_DSWDTPS_POSITION               0x00000015
#define _ADEVCFG2_DSWDTPS_MASK                   0x03E00000
#define _ADEVCFG2_DSWDTPS_LENGTH                 0x00000005

#define _ADEVCFG2_DSWDTOSC_POSITION              0x0000001A
#define _ADEVCFG2_DSWDTOSC_MASK                  0x04000000
#define _ADEVCFG2_DSWDTOSC_LENGTH                0x00000001

#define _ADEVCFG2_DSWDTEN_POSITION               0x0000001B
#define _ADEVCFG2_DSWDTEN_MASK                   0x08000000
#define _ADEVCFG2_DSWDTEN_LENGTH                 0x00000001

#define _ADEVCFG2_FDSEN_POSITION                 0x0000001C
#define _ADEVCFG2_FDSEN_MASK                     0x10000000
#define _ADEVCFG2_FDSEN_LENGTH                   0x00000001

#define _ADEVCFG2_UPLLFSEL_POSITION              0x0000001E
#define _ADEVCFG2_UPLLFSEL_MASK                  0x40000000
#define _ADEVCFG2_UPLLFSEL_LENGTH                0x00000001

